<center><h1><b><font size="6">Pandas Series: Attribute and Method Chaining</font></b></h1></center>

#### Import pandas

In [1]:
import pandas as pd

#### Load the data

In [2]:
data = pd.read_csv('./data/Location.csv')
location_data = data.copy()
location_data.head()

      Location
0   Location 3
1   Location 6
2   Location 8
3  Location 26
4  Location 34

In [4]:
location_data.index

RangeIndex(start=0, stop=1043, step=1)

In [10]:
column_names = location_data.columns
column_names

Index(['Location'], dtype='object')

In [6]:
location_data.Location

0        Location 3
1        Location 6
2        Location 8
3       Location 26
4       Location 34
           ...
1038    Location 73
1039    Location 82
1040    Location 11
1041    Location 26
1042    Location 94
Name: Location, Length: 1043, dtype: object

In [15]:
location_data.index.name
location_data

         Location
0      Location 3
1      Location 6
2      Location 8
3     Location 26
4     Location 34
...           ...
1038  Location 73
1039  Location 82
1040  Location 11
1041  Location 26
1042  Location 94

[1043 rows x 1 columns]

In [17]:
location_data.index.name = 'Index'
location_data

          Location
Index
0       Location 3
1       Location 6
2       Location 8
3      Location 26
4      Location 34
...            ...
1038   Location 73
1039   Location 82
1040   Location 11
1041   Location 26
1042   Location 94

[1043 rows x 1 columns]

In [18]:
location_data.index.name

'Index'

In [20]:
location_data.sort_values(by='Location')

          Location
Index
637     Location 1
884     Location 1
465     Location 1
716    Location 10
623    Location 10
...            ...
482    Location 97
128    Location 97
669    Location 97
757    Location 98
372    Location 99

[1043 rows x 1 columns]

In [21]:
location_data.sort_values(by='Location').head()

          Location
Index
637     Location 1
884     Location 1
465     Location 1
716    Location 10
623    Location 10

In [22]:
location_data.sort_values(by='Location').tail()

          Location
Index
482    Location 97
128    Location 97
669    Location 97
757    Location 98
372    Location 99

In [23]:
location_data.index

RangeIndex(start=0, stop=1043, step=1, name='Index')

In [24]:
type(location_data.index)

pandas.core.indexes.range.RangeIndex

In [25]:
location_data.index.to_numpy()

array([   0,    1,    2, ..., 1040, 1041, 1042], dtype=int64)

In [12]:
location_values_head = location_data['Location'].head()
location_values_head

0     Location 3
1     Location 6
2     Location 8
3    Location 26
4    Location 34
Name: Location, dtype: object